GopalSaraf/Practicals/PSDL/include/proc/pic18f258.inc
// Register: RXB1EIDL
#define RXB1EIDL RXB1EIDL
RXB1EIDL                                 equ 0F54h
// bitfield definitions
RXB1EIDL_EID0_POSN                       equ 0000h
RXB1EIDL_EID0_POSITION                   equ 0000h
RXB1EIDL_EID0_SIZE                       equ 0001h
RXB1EIDL_EID0_LENGTH                     equ 0001h
RXB1EIDL_EID0_MASK                       equ 0001h
RXB1EIDL_EID1_POSN                       equ 0001h
RXB1EIDL_EID1_POSITION                   equ 0001h
RXB1EIDL_EID1_SIZE                       equ 0001h
RXB1EIDL_EID1_LENGTH                     equ 0001h
RXB1EIDL_EID1_MASK                       equ 0002h
RXB1EIDL_EID2_POSN                       equ 0002h
RXB1EIDL_EID2_POSITION                   equ 0002h
RXB1EIDL_EID2_SIZE                       equ 0001h
RXB1EIDL_EID2_LENGTH                     equ 0001h
RXB1EIDL_EID2_MASK                       equ 0004h
RXB1EIDL_EID3_POSN                       equ 0003h
RXB1EIDL_EID3_POSITION                   equ 0003h
RXB1EIDL_EID3_SIZE                       equ 0001h
RXB1EIDL_EID3_LENGTH                     equ 0001h
RXB1EIDL_EID3_MASK                       equ 0008h
RXB1EIDL_EID4_POSN                       equ 0004h
RXB1EIDL_EID4_POSITION                   equ 0004h
RXB1EIDL_EID4_SIZE                       equ 0001h
RXB1EIDL_EID4_LENGTH                     equ 0001h
RXB1EIDL_EID4_MASK                       equ 0010h
RXB1EIDL_EID5_POSN                       equ 0005h
RXB1EIDL_EID5_POSITION                   equ 0005h
RXB1EIDL_EID5_SIZE                       equ 0001h
RXB1EIDL_EID5_LENGTH                     equ 0001h
RXB1EIDL_EID5_MASK                       equ 0020h
RXB1EIDL_EID6_POSN                       equ 0006h
RXB1EIDL_EID6_POSITION                   equ 0006h
RXB1EIDL_EID6_SIZE                       equ 0001h
RXB1EIDL_EID6_LENGTH                     equ 0001h
RXB1EIDL_EID6_MASK                       equ 0040h
RXB1EIDL_EID7_POSN                       equ 0007h
RXB1EIDL_EID7_POSITION                   equ 0007h
RXB1EIDL_EID7_SIZE                       equ 0001h
RXB1EIDL_EID7_LENGTH                     equ 0001h
RXB1EIDL_EID7_MASK                       equ 0080h
RXB1EIDL_RXB1EID0_POSN                   equ 0000h
RXB1EIDL_RXB1EID0_POSITION               equ 0000h
RXB1EIDL_RXB1EID0_SIZE                   equ 0001h
RXB1EIDL_RXB1EID0_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID0_MASK                   equ 0001h
RXB1EIDL_RXB1EID1_POSN                   equ 0001h
RXB1EIDL_RXB1EID1_POSITION               equ 0001h
RXB1EIDL_RXB1EID1_SIZE                   equ 0001h
RXB1EIDL_RXB1EID1_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID1_MASK                   equ 0002h
RXB1EIDL_RXB1EID2_POSN                   equ 0002h
RXB1EIDL_RXB1EID2_POSITION               equ 0002h
RXB1EIDL_RXB1EID2_SIZE                   equ 0001h
RXB1EIDL_RXB1EID2_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID2_MASK                   equ 0004h
RXB1EIDL_RXB1EID3_POSN                   equ 0003h
RXB1EIDL_RXB1EID3_POSITION               equ 0003h
RXB1EIDL_RXB1EID3_SIZE                   equ 0001h
RXB1EIDL_RXB1EID3_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID3_MASK                   equ 0008h
RXB1EIDL_RXB1EID4_POSN                   equ 0004h
RXB1EIDL_RXB1EID4_POSITION               equ 0004h
RXB1EIDL_RXB1EID4_SIZE                   equ 0001h
RXB1EIDL_RXB1EID4_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID4_MASK                   equ 0010h
RXB1EIDL_RXB1EID5_POSN                   equ 0005h
RXB1EIDL_RXB1EID5_POSITION               equ 0005h
RXB1EIDL_RXB1EID5_SIZE                   equ 0001h
RXB1EIDL_RXB1EID5_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID5_MASK                   equ 0020h
RXB1EIDL_RXB1EID6_POSN                   equ 0006h
RXB1EIDL_RXB1EID6_POSITION               equ 0006h
RXB1EIDL_RXB1EID6_SIZE                   equ 0001h
RXB1EIDL_RXB1EID6_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID6_MASK                   equ 0040h
RXB1EIDL_RXB1EID7_POSN                   equ 0007h
RXB1EIDL_RXB1EID7_POSITION               equ 0007h
RXB1EIDL_RXB1EID7_SIZE                   equ 0001h
RXB1EIDL_RXB1EID7_LENGTH                 equ 0001h
RXB1EIDL_RXB1EID7_MASK                   equ 0080h

// Register: RXB1DLC
#define RXB1DLC RXB1DLC
RXB1DLC                                  equ 0F55h
// bitfield definitions
RXB1DLC_DLC0_POSN                        equ 0000h
RXB1DLC_DLC0_POSITION                    equ 0000h
RXB1DLC_DLC0_SIZE                        equ 0001h
RXB1DLC_DLC0_LENGTH                      equ 0001h
RXB1DLC_DLC0_MASK                        equ 0001h
RXB1DLC_DLC1_POSN                        equ 0001h
RXB1DLC_DLC1_POSITION                    equ 0001h
RXB1DLC_DLC1_SIZE                        equ 0001h
RXB1DLC_DLC1_LENGTH                      equ 0001h
RXB1DLC_DLC1_MASK                        equ 0002h
RXB1DLC_DLC2_POSN                        equ 0002h
RXB1DLC_DLC2_POSITION                    equ 0002h
RXB1DLC_DLC2_SIZE                        equ 0001h
RXB1DLC_DLC2_LENGTH                      equ 0001h
RXB1DLC_DLC2_MASK                        equ 0004h
RXB1DLC_DLC3_POSN                        equ 0003h
RXB1DLC_DLC3_POSITION                    equ 0003h
RXB1DLC_DLC3_SIZE                        equ 0001h
RXB1DLC_DLC3_LENGTH                      equ 0001h
RXB1DLC_DLC3_MASK                        equ 0008h
RXB1DLC_RB0_POSN                         equ 0004h
RXB1DLC_RB0_POSITION                     equ 0004h
RXB1DLC_RB0_SIZE                         equ 0001h
RXB1DLC_RB0_LENGTH                       equ 0001h
RXB1DLC_RB0_MASK                         equ 0010h
RXB1DLC_RB1_POSN                         equ 0005h
RXB1DLC_RB1_POSITION                     equ 0005h
RXB1DLC_RB1_SIZE                         equ 0001h
RXB1DLC_RB1_LENGTH                       equ 0001h
RXB1DLC_RB1_MASK                         equ 0020h
RXB1DLC_RXRTR_POSN                       equ 0006h
RXB1DLC_RXRTR_POSITION                   equ 0006h
RXB1DLC_RXRTR_SIZE                       equ 0001h
RXB1DLC_RXRTR_LENGTH                     equ 0001h
RXB1DLC_RXRTR_MASK                       equ 0040h
RXB1DLC_RESB0_POSN                       equ 0004h
RXB1DLC_RESB0_POSITION                   equ 0004h
RXB1DLC_RESB0_SIZE                       equ 0001h
RXB1DLC_RESB0_LENGTH                     equ 0001h
RXB1DLC_RESB0_MASK                       equ 0010h
RXB1DLC_RESB1_POSN                       equ 0005h
RXB1DLC_RESB1_POSITION                   equ 0005h
RXB1DLC_RESB1_SIZE                       equ 0001h
RXB1DLC_RESB1_LENGTH                     equ 0001h
RXB1DLC_RESB1_MASK                       equ 0020h
RXB1DLC_RXB1DLC0_POSN                    equ 0000h
RXB1DLC_RXB1DLC0_POSITION                equ 0000h
RXB1DLC_RXB1DLC0_SIZE                    equ 0001h
RXB1DLC_RXB1DLC0_LENGTH                  equ 0001h
RXB1DLC_RXB1DLC0_MASK                    equ 0001h
RXB1DLC_RXB1DLC1_POSN                    equ 0001h
RXB1DLC_RXB1DLC1_POSITION                equ 0001h
RXB1DLC_RXB1DLC1_SIZE                    equ 0001h
RXB1DLC_RXB1DLC1_LENGTH                  equ 0001h
RXB1DLC_RXB1DLC1_MASK                    equ 0002h
RXB1DLC_RXB1DLC2_POSN                    equ 0002h
RXB1DLC_RXB1DLC2_POSITION                equ 0002h
RXB1DLC_RXB1DLC2_SIZE                    equ 0001h
RXB1DLC_RXB1DLC2_LENGTH                  equ 0001h
RXB1DLC_RXB1DLC2_MASK                    equ 0004h
RXB1DLC_RXB1DLC3_POSN                    equ 0003h
RXB1DLC_RXB1DLC3_POSITION                equ 0003h
RXB1DLC_RXB1DLC3_SIZE                    equ 0001h
RXB1DLC_RXB1DLC3_LENGTH                  equ 0001h
RXB1DLC_RXB1DLC3_MASK                    equ 0008h
RXB1DLC_RXB1RB0_POSN                     equ 0004h
RXB1DLC_RXB1RB0_POSITION                 equ 0004h
RXB1DLC_RXB1RB0_SIZE                     equ 0001h
RXB1DLC_RXB1RB0_LENGTH                   equ 0001h
RXB1DLC_RXB1RB0_MASK                     equ 0010h
RXB1DLC_RXB1RB1_POSN                     equ 0005h
RXB1DLC_RXB1RB1_POSITION                 equ 0005h
RXB1DLC_RXB1RB1_SIZE                     equ 0001h
RXB1DLC_RXB1RB1_LENGTH                   equ 0001h
RXB1DLC_RXB1RB1_MASK                     equ 0020h
RXB1DLC_RXB1RTR_POSN                     equ 0006h
RXB1DLC_RXB1RTR_POSITION                 equ 0006h
RXB1DLC_RXB1RTR_SIZE                     equ 0001h
RXB1DLC_RXB1RTR_LENGTH                   equ 0001h
RXB1DLC_RXB1RTR_MASK                     equ 0040h

// Register: RXB1D0
#define RXB1D0 RXB1D0
RXB1D0                                   equ 0F56h
// bitfield definitions
RXB1D0_RXB1D00_POSN                      equ 0000h
RXB1D0_RXB1D00_POSITION                  equ 0000h
RXB1D0_RXB1D00_SIZE                      equ 0001h
RXB1D0_RXB1D00_LENGTH                    equ 0001h
RXB1D0_RXB1D00_MASK                      equ 0001h
RXB1D0_RXB1D01_POSN                      equ 0001h
RXB1D0_RXB1D01_POSITION                  equ 0001h
RXB1D0_RXB1D01_SIZE                      equ 0001h
RXB1D0_RXB1D01_LENGTH                    equ 0001h
RXB1D0_RXB1D01_MASK                      equ 0002h
RXB1D0_RXB1D02_POSN                      equ 0002h
RXB1D0_RXB1D02_POSITION                  equ 0002h
RXB1D0_RXB1D02_SIZE                      equ 0001h
RXB1D0_RXB1D02_LENGTH                    equ 0001h
RXB1D0_RXB1D02_MASK                      equ 0004h
RXB1D0_RXB1D03_POSN                      equ 0003h
RXB1D0_RXB1D03_POSITION                  equ 0003h
RXB1D0_RXB1D03_SIZE                      equ 0001h
RXB1D0_RXB1D03_LENGTH                    equ 0001h
RXB1D0_RXB1D03_MASK                      equ 0008h
RXB1D0_RXB1D04_POSN                      equ 0004h
RXB1D0_RXB1D04_POSITION                  equ 0004h
RXB1D0_RXB1D04_SIZE                      equ 0001h
RXB1D0_RXB1D04_LENGTH                    equ 0001h
RXB1D0_RXB1D04_MASK                      equ 0010h
RXB1D0_RXB1D05_POSN                      equ 0005h
RXB1D0_RXB1D05_POSITION                  equ 0005h
RXB1D0_RXB1D05_SIZE                      equ 0001h
RXB1D0_RXB1D05_LENGTH                    equ 0001h
RXB1D0_RXB1D05_MASK                      equ 0020h
RXB1D0_RXB1D06_POSN                      equ 0006h
RXB1D0_RXB1D06_POSITION                  equ 0006h
RXB1D0_RXB1D06_SIZE                      equ 0001h
RXB1D0_RXB1D06_LENGTH                    equ 0001h
RXB1D0_RXB1D06_MASK                      equ 0040h
RXB1D0_RXB1D07_POSN                      equ 0007h
RXB1D0_RXB1D07_POSITION                  equ 0007h
RXB1D0_RXB1D07_SIZE                      equ 0001h
RXB1D0_RXB1D07_LENGTH                    equ 0001h
RXB1D0_RXB1D07_MASK                      equ 0080h

